cornerFlow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


scale   1.0;

x_a		2.0;
x_b		20.0;
y_a		2.0;
y_b		4.0;

mesh_xleft		50;
mesh_xright		150;
mesh_ybottom	50;
mesh_ytop		30;

vertices
(
	($x_a 0 -1.0)
	($x_b 0 -1.0)
	(0 $y_a -1.0)
	($x_a $y_a -1.0)
	($x_b $y_a -1.0)
	(0 $y_b -1.0)
	($x_a $y_b -1.0)
	($x_b $y_b -1.0)
	
	($x_a 0 1.0)
	($x_b 0 1.0)
	(0 $y_a 1.0)
	($x_a $y_a 1.0)
	($x_b $y_a 1.0)
	(0 $y_b 1.0)
	($x_a $y_b 1.0)
	($x_b $y_b 1.0)
);

blocks
(
	hex (0 1 4 3 8 9 12 11) ($mesh_xright $mesh_ybottom 1) simpleGrading (8 1 1) // bottom block
	hex (3 4 7 6 11 12 15 14) ($mesh_xright $mesh_ytop 1) simpleGrading (8 1 1) // top right block
	hex (2 3 6 5 10 11 14 13) ($mesh_xleft $mesh_ytop 1) simpleGrading (1 1 1) // top left block
);

edges
(
);

boundary // right hand rule into block
(
    inlet
    {
        type patch;
        faces
        (
			(2 10 13 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
			(1 4 12 9)
			(4 7 15 12)
        );
    }
	topPatch
	{
		type patch;
		faces
		(
			(5 13 14 6)
			(6 14  15 7)
		);
	}
	fixedWall
	{
		type wall;
		faces
		(
			(2 3 11 10)
            (3 0 8 11)
			(0 1 9 8)
		);
	}
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 4 1)
			(2 5 6 3)
			(3 6 7 4)
			
            (8 9 12 11)
			(10 11 14 13)
			(11 12 15 14)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
