cornerFlow/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include	"include/initialConditions";
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform ($xFlowVelocity 0 0); // initial condition for velocity in all cells, not a boundary condition representation

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }
	
    fixedWall
    {
        type            noSlip;
    }

    frontAndBack
    {
		type			empty;
    }

    topPatch
    {
		type			zeroGradient;
    }
}

// ************************************************************************* //
