cornerFlow/0.orig/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

ReynoldsNumber		1.25e8;
nu			1e-6;
characteristicLength	2.5;
xFlowVelocity         	#calc	"$ReynoldsNumber*$nu/$characteristicLength";

turbulenceIntensity		0.1;
kBoundaryValue			#calc	"1.5*pow($turbulenceIntensity*$xFlowVelocity, 2)";

mixingLength			#calc	"0.07*$characteristicLength";
epsilonBoundaryValue	#calc	"pow(0.09, 3/4)*pow($kBoundaryValue, 1.5)/$mixingLength";

// ************************************************************************* //
