cornerFlow/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include	"include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kBoundaryValue;

boundaryField
{
    inlet
    {
		type			turbulentIntensityKineticEnergyInlet;
		intensity		$turbulenceIntensity;
		value			$internalField;
    }
	
    outlet
    {
        type            zeroGradient;
    }

    fixedWall
    {
        type            kqRWallFunction; // wall function at high Re
        value           $internalField; // just an initial guess
    }
	
	frontAndBack
	{
		type			empty;
	}
	
	topPatch
	{
		type			zeroGradient;
	}
}


// ************************************************************************* //
